"""
Розробити програму, яка:
а) створює текстовий файл TF12_1 із символьних рядків різної довжини;
б) читає вміст файлу TF12_1 і записує його у файл TF12_2 по рядках: у першому – один символ,
у другому – два символи, … , у десятому – десять символів,
в одинадцятому – один символ і т. д. (останній рядок може бути не повним);
в) читає вміст файлу TF12_2 і друкує його по рядках.
"""

def Open(file_name, mode):
    try:
        file = open(file_name, mode, encoding="utf-8") # Відкриття файлу, encoding="utf-8" потрібне для того, щоб у файлах відображалися українські символи
    except:
        print("Файл", file_name, "не відкрився!")
        return None
    else:
        print("Файл", file_name, "відкрито!")
        return file # Повернення результату
"""
Функція, необхідна для безпечного відкриття файлів.
Виконує перевірку на критичні ситуації.
Аргументами функції виступають файл та його режим відкриття.
"""

def Operation(file1, file2):
    f1 = Open(file1, "r",)
    text = f1.read().replace("\n", " ") # Зчитування всього тексту та перетворення його в один рядок
    f2 = Open(file2, "w")
    i = 1
    pos = 0
    # Умова виконується доки, поки не вдасться досягнути кінця рядка
    while pos < len(text):
        f2.write(text[pos:pos+i]+"\n") # Запис у файл зрізу рядка
        pos += i
        i += 1
        if i > 10: # Якщо зріз рядка досяг 10 символів
            i = 1 # Оновлення параметрів зрізу
    print(f"Файл {file2} створено!")
    f1.close() # Закриття файлу
    f2.close() # Закриття файлу
    print(f"Файли {file1} та {file2} закрито!")
"""
Функція, необхідна для читання вмісту одного файлу і записування його у другий файл по рядках: у першому – один символ,
у другому – два символи, … , у десятому – десять символів,
в одинадцятому – один символ і т. д.
Аргументами функції є два файли: file1 - з якого зчитують інформацію, file2 - у який заносять її.
"""

def file_print(file2):
    f2 = Open(file2, "r")
    if f2 != None:
        for line in f2:
            print("-----------\n", line.strip()) # Друк кожного рядка без зайвих пробілів у кінці та на початку
    f2.close() # Закриття файлу
    print(f"Файл {file2} закрито!")
"""
Функція, що використовується для друку вмісту файлу на екран без зайвих пробілів на кожному рядку.
Аргументом функції є файл
"""

def main():
    file1_name = "TF12_1.txt"
    file2_name = "TF12_2.txt"
    file1_w = Open(file1_name, "w")
    # Запис інформації у файл
    if (file1_w != None):
        file1_w.write("Кожного разу, коли людина пише код, вона створює початковий код, що є набором команд і інструкцій, які комп'ютер може зрозуміти та виконати.\n")
        file1_w.write("Цей процес називається програмуванням, а програмування – це написання коду, використовуючи певні мови програмування.\n")
        print("Інформація була успішно додана до TF12_1.txt...")
        file1_w.close() # Закриття файлу
        print("Файл TF12_1.txt закрито!")
        Operation(file1_name, file2_name)
        file_print(file2_name)
main()
"""
Головна функція програми.
У ній створюються файли та відбувається різні махінації з ними.
"""
