"""
Знайти та роздрукувати суму усіх парних та добуток непарних цілих чисел в діапазоні від 0 до 20.
"""

sum_even=0 # Ініціалізація змінної для суми парних чисел
prod_odd=1 # Ініціалізація змінної для добутку непарних чисел
for i in range(0,21,1): # Оператор циклу for, початок з 0 до 20 з кроком 1
    if(i%2==0): # Умовний оператор if, якщо число ділиться на 2 без остачі
        sum_even+=i # Додання цього числа до суми парних
    else: # Умовний оператор else, інакше
        prod_odd*=i # додання числа до добутку непарних
print("Сума всіх парних чисел від 0 до 20: ", sum_even) # Виведення суми парних чисел на екран
print("Добуток всіх непарних чисел від 0 до 20: ", prod_odd) # Виведення добутку непарних чисел на екран
