"""
Вводиться ціле число N (1<N<9), а виводяться рядки з числами або іншими символами (*, #),
які утворюють визначений «рисунок» (останній задається варіантом).
"""

n = int(input("Введіть висоту піраміди: ")) # Ввід з клавіатури значення висоти піраміди
while(n<0 or n>9): # Оператор циклу while, поки висота піраміди не буде задовольняти нерівність 0<n<9
    n = int(input("Введіть висоту піраміди: ")) # Ввід з клавіатури значення висоти піраміди
for i in range(1, n + 1, 1): # Оператор циклу for, проходження по рядках, починаючи з 1 до n+1 з кроком 1
    num = 5 # Ініціалізація змінної num
    for j in range(n, 0, -1): # Оператор циклу for, проходження по стовпчиках, починаючи з n до 0 з кроком -1
        if (j<i): # Умовний оператор if, якщо індекс стовпчиків менший за індекс рядків
            print(" ", end="") # Друк пропуску без переходу на новий рядок
        else: # Умовний оператор else
            print(num, end="") # Друк числа без переходу на новий рядок
    print("") # Відступ
for i in range(n, 0, -1): # Оператор циклу for, проходження по рядках, починаючи з n до 0 з кроком -1
    num = 5 #
    for j in range(n, 0, -1): # Оператор циклу for, проходження по стовпчиках, починаючи з n до 0 з кроком -1
        if (j<i): # Умовний оператор if, якщо індекс стовпчиків менший за індекс рядків
            print(" ", end="") # Друк пропуску без переходу на новий рядок
        else: # Умовний оператор else
            print(num, end="") # Друк числа без переходу на новий рядок
    print("") # Відступ