"""
Написати програму, яка обчислює значення X в залежно від значень a та b, введених користувачем з клавіатури.
Числа a та b можуть бути лише додатними.
"""

a=float(input("Введіть значення а (>0): ")) # Ввід з клавіатури значення змінної a
while (a<0): # Оператор циклу while, виконувати пкои a<0
    a = float(input("Введіть значення а (>0): ")) # Ввід з клавіатури значення змінної a
b=float(input("Введіть значення b (>0): ")) # Ввід з клавіатури значення змінної b
while(b<0): # Оператор циклу while, виконувати пкои b<0
    b = float(input("Введіть значення b (>0): ")) # Ввід з клавіатури значення змінної b
if (a>b): # Умовний оператор if, якщо a>b
    X=b*a-1 # Обчислювати даний вираз
elif (a==b): # Умовний оператор elif, інакше якщо a=b
    X=-10 # Присвоїти виразу значення -10
elif(a<b): # Умовний оператор elif, інакше якщо a<b
    X=(a-5)/b # Обчислювати даний вираз
print("Результат обчислення: ", X) # Виведення результату на екран
