"""
Реалізувати дві функції користувача в одній програмі.
"""
import math # Підключення модуля, потрібного для математичних обчислень

def expression1_func(x): # Визначення функції, що обчислює значення математичного виразу
    if(x<0): # Умовний оператор if, якщо число є від'ємним
        return 1 # Повернення 1
    else: # Умовний оператор else, інакше
        z=math.exp(x)+math.sqrt(x) # Обчислення математичного виразу
        return z # Повернення результату
"""
Ця функція потрібна для обчислення математичного виразу при заданому х:
x=0
expression1_func(x)=1
"""
def expression2_func(n): # Визначення функції, що знаходить суму цифр у числі
    sum=0 # Ініціалізація змінної для збереження суми цифр числа
    n=abs(n) # Якщо введено від'ємне число, то значення зводиться до абсолютного
    while(n>0): # Оператор циклу while, поки аргумент функції більше нуля
        sum+=n%10 # Сума десяткових залишків
        n=n//10 # Оновлення числа, всі десяткові залишки відкидаються
    return sum # Повернення результату
"""
Ця функція потрібна для знаходження суми цифр у заданому числі x:
x=24
expression2_func(x)=6
"""
x=float(input("Введіть значення x: ")) # Ввід з клавіатури значення змінної х
n=float(input("Введіть значення n: ")) # Ввід з клавіатури значення змінної у
if(expression1_func(x)!=1): # Умовний оператор if, якщо функція не повертає значення 1
    print("Значення виразу z = ", expression1_func(x)) # Вивід результату обчислення виразу на екран
else: # Умовний оператор else, інакше
    print("\t[ПОМИЛКА!!!]\nКорінь з від'ємного числа") # Виведення повідомлення з помилкою на екран
print(f"Сума цифр числа {n}: ", expression2_func(n)) # Вивід суми цифр числа


