'''
Реалізувати функцію 2 із завдання 1 у вигляді окремого модуля,
підключити її в основну програму і продемонструвати роботу з нею.
'''

from mymod import expression2_func # Підключення власно створеного модуля

x=float(input("Введіть значення x: ")) # Ввід значення змінної х з клавіатури
y=float(input("Введіть значення y: ")) # Ввід значення змінної у з клавіатури
sum = x+y # Обчислення суми значень
sum_of_numbers = expression2_func(x)+expression2_func(y) # Обчислення суми цифр кожного числа
print("Сума чисел: ", sum) # Вивід суми чисел на екран
print("Сума цифр чисел: ", sum_of_numbers) # Вивід суми цифр чисел на екран
if(sum_of_numbers>sum): # Умовний оператор if, якщо значення суми цифр чисел більше за значення суми чисел
    print("Сума цифр чисел більша за суму чисел") # Вивід відповідного повідомлення на екран
elif (sum_of_numbers==sum): # Умовний оператор if, якщо значення суми цифр чисел дорівнює значенню суми чисел
    print("Сума цифр чисел дорівнює сумі чисел") # Вивід відповідного повідомлення на екран
else: # Умовний оператор else, інакше
    print("Сума цифр чисел менша за суму чисел") # Вивід відповідного повідомлення на екран


