"""
Побудуйте графік функції.
Оберіть суцільний тип лінії, задайте колір та товщину графіку та позначте осі,
виведіть назву графіка на екран, вставте легенду.
Використайте бібліотеку Matplotlib.

Y(x)=5*cos(10*x)*sin(3*x)/(x^(1/2)), x=[0...5]
"""

import matplotlib.pyplot as plt # Підключення модуля pyplot з бібліотеки matplotlib, необхідного для роботи з графіками
import numpy as np # Підключення модуля numpy для роботи з масивами та обчислення значень функції, що містить в собі тригонометричну функцію, для кожного х

x = np.linspace(1, 5, 50) # Створення масиву даних для х є [1;5], що містить в собі 50 точок

y = 5*np.cos(10*x)*np.sin(3*x)/(x**(1/2)) # Функція задана для y, що обчислює значення функції на кожному кроці

plt.plot(x, y, label = '5*cos(10*x)*sin(3*x)/(x^(1/2))', color = 'blue', linewidth = 5) # Побудова графіка функції

plt.title('Графік функції', fontsize = 14)   # Назва графіка

plt.xlabel('x', fontsize = 14, color = 'blue') # Позначення осі абсцис
plt.ylabel('y', fontsize = 14, color = 'blue') # Позначення осі ординат
plt.legend(title = 'Функція:', fontsize = 14) # Позначення на графіку легенди
plt.grid(True) # Увімкнення сітки для графіка
plt.savefig('figure1.png') # Збереження даного графіку у форматі .png
plt.show() # Виведення створеного графіка на екран
