"""
Побудуйте кругову діаграму на основі даних з предметної області лабораторної роботи №12.
Використайте бібліотеку Matplotlib.
На круговій діаграмі мають відображатися значення показників у відсотках, наприклад, відсоток дівчат та хлопців,
які навчаються у певному класі,
сектори діаграми повинні бути розфарбовані в різний колір, на діаграмі мають бути підписи.
"""

from matplotlib import pyplot as plt # Підключення модуля pyplot з бібліотеки matplotlib, необхідного для роботи з діаграмами
import numpy as np # Підключення модуля numpy для роботи з масивами та обчислення значень функції для кожного х

fig, ax = plt.subplots(figsize = (6, 3), subplot_kw = dict(aspect = "equal")) # Створення полотна для діаграми
# Записані дані з предметної області лабораторної роботи №9
students = [
        "Гриценко 150 см",
        "Павленко 178 см",
        "Лунцевич 163 см",
        "Бабакович 152 см",
        "Бринькевич 180 см",
        "Мельник 154 см",
        "Гринькевич 147 см",
        "Ждан 190 см",
        "Фамільянович 181 см",
        "Отрукиотбиванич 134 см"
    ]
names = [] # Створення списку names
# Додання імен у список
for x in students:
    names.append(x.split()[0])
# Додання значень зросту в список
heights = []  # Створення списку heights
# Додання значення зросту в список
for x in students:
    heights.append(float(x.split()[1]))

# Функція для підписів у відсотках
def func(pct, allvals):
    absolute = int(np.round(pct / 100. * np.sum(allvals)))
    return f"{pct:.1f}%\n({absolute} см)"

# Побудова кругової діаграми
wedges, texts, autotexts = ax.pie(heights, autopct = lambda pct: func(pct, heights), textprops = dict(color='w'))

# Додавання легенди
ax.legend(wedges, names, title = 'Учні:', loc = 'center left', bbox_to_anchor = (1, 0, 0.5, 1))

# Налаштування тексту
plt.setp(autotexts, size = 8, weight = 'bold')

# Назва графіка
ax.set_title('Зріст учнів (кругова діаграма)')

plt.savefig('figure3.png') # Збереження даної діаграми у форматі .png
plt.show() # Виведення створеної діаграми на екран