"""
Візуалізація даних з порталу відкритих даних https://databank.worldbank.org/home.aspx.
Використайте бібліотеку Matplotlib.

Самостійно оберіть предметну область, наприклад, Education Statistics, з якої візьміть показник, наприклад,
Children out of school, primary в динаміці за останніх двадцять років (або інший період,
якщо дані для цього періоду на порталі відсутні) для України та однієї з країн світу на вибір, наприклад, США.
Сформуйте масив даних для побудови графіку та напишіть програму для їх візуалізації.

2.1. На одній координатній осі побудуйте графіки, що показують динаміку показника для двох країн,
підпишіть осі – по осі Х має відображатися рік, а по осі Y має відображатися значення показника.

2.2 Побудуйте стовпчасті діаграми, які відображатимуть значення показника для кожної з країн.
Назву країни для побудови діаграми має вводити користувач з клавіатури.
"""

import csv # Підключення модуля для роботи з CSV файлами

from matplotlib import pyplot as plt # Підключення модуля pyplot з бібліотеки matplotlib, необхідного для роботи з графіками
# Створення списків для збереження даних з CSV файлу
time = []
Ukraine = []
USA = []
try:
    with open('lab10.2.csv', 'r') as f: # Відкриття файлу lab.csv у режимі читання, використовуючи конструкцією with
        reader = csv.DictReader(f, delimiter=';') # Зчитування CSV файлу, розділеного крапкою з комою та створення ітератора
        rows = list(reader) # Перетворення ітератора в список, тепер ітерувати можна кілька разів
except FileNotFoundError:
    print("[ПОМИЛКА] - Помилка при зчитуванні даних з файлу")
# Прохід по кожному елементу списку та занесення даних у відповідний список
for r in rows:
    year = int(float(r.get('Time').strip()))
    value = float(r.get('Value'))
    if r.get('Country Code')=='USA':
        USA.append(value)
    elif r.get('Country Code')=='UKR':
        Ukraine.append(value)
    if r.get('Country Code') == 'UKR':
        time.append(year)

while True:
    print("-----ГОЛОВНЕ МЕНЮ:-----\n>1< - Побудувати лінійні графіки для відображення кількості населення за 20 років України та США;\n>2< - Побудувати стовпчасту діаграму для відображення кількості населення за 20 років України або США;\n>0< - Вихід з програми.")
    choose = str(input("~~Оберіть пункт меню: "))
    if choose == '1':
        # Створення ліній тренду на графіку
        plt.plot(time, Ukraine, label = 'Україна', color = 'yellow', linewidth = 5)
        plt.plot(time, USA, label = 'США', color = 'red', linewidth = 5)

        plt.title('Population, total', fontsize = 14) # Назва графіка
        plt.xlabel('Роки', fontsize = 14, color = 'black') # Позначення осі абсцис
        plt.ylabel('Кількість населення', fontsize = 14, color = 'black') # Позначення осі ординат
        plt.legend(title = 'Країни:', fontsize = 14) # Позначення на графіку легенди
        plt.grid(True) # Увімкнення сітки для графіка
        plt.savefig('figure2.1.png') # Збереження даного графіку у форматі .png
        plt.show() # Виведення створеного графіка на екран
    elif choose == '2':
        print("-----ПІДМЕНЮ:-----\n>2.1< - Побудувати стовпчасту діаграму для відображення кількості населення за 20 років України;\n>2.2< - Побудувати стовпчасту діаграму для відображення кількості населення за 20 років США;\n>2.0< - Вихід в головне меню.")
        inchoose = str(input(">Оберіть пункт підменю: "))
        while True:
            if inchoose == '2.1':
                y = range(len(Ukraine)) # Створення індексів для кожного стовпчика
                ax = plt.gca() # Отримання поточної системи координат
                ax.bar(y, Ukraine, align='edge') # Створення стовпчикової діаграми
                ax.set_xticks(y) # Встановлення місця для підписів на осі Y
                ax.set_xticklabels(time, rotation = 45) # Встановлення місця для підписів на осі X
                # Встановлення підписів до стовпчикової діаграми
                plt.title('Населення України')
                plt.xlabel('Роки')
                plt.ylabel('Кількість населення')
                plt.savefig('figure2.2.1.png')  # Збереження даного графіку у форматі .png
                plt.show() # Виведення створеного графіка на екран
                break
            elif inchoose == '2.2':
                z = range(len(USA)) # Створення індексів для кожного стовпчика
                ax = plt.gca() # Отримання поточної системи координат
                ax.bar(z, USA, align='edge') # Створення стовпчикової діаграми
                ax.set_xticks(z) # Встановлення місця для підписів на осі Y
                ax.set_xticklabels(time, rotation = 45) # Встановлення місця для підписів на осі X
                # Встановлення підписів до стовпчикової діаграми
                plt.title('Населення США')
                plt.xlabel('Роки')
                plt.ylabel('Кількість населення')
                plt.savefig('figure2.2.2.png')  # Збереження даного графіку у форматі .png
                plt.show() # Виведення створеного графіка на екран
                break
            elif inchoose == '2.0':
                break
    elif choose == '0':
        break