"""
Візуалізація даних з порталу відкритих даних https://databank.worldbank.org/home.aspx.
Використайте бібліотеку Matplotlib.

Самостійно оберіть предметну область, наприклад, Education Statistics, з якої візьміть показник, наприклад,
Children out of school, primary в динаміці за останніх двадцять років (або інший період,
якщо дані для цього періоду на порталі відсутні) для України та однієї з країн світу на вибір, наприклад, США.
Сформуйте масив даних для побудови графіку та напишіть програму для їх візуалізації.

2.1. На одній координатній осі побудуйте графіки, що показують динаміку показника для двох країн,
підпишіть осі – по осі Х має відображатися рік, а по осі Y має відображатися значення показника.

2.2 Побудуйте стовпчасті діаграми, які відображатимуть значення показника для кожної з країн.
Назву країни для побудови діаграми має вводити користувач з клавіатури.
"""

from matplotlib import pyplot as plt # Підключення модуля pyplot з бібліотеки matplotlib, необхідного для роботи з графіками

# Інформація про population, total за двадцять років для України та США
x = [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024]
y = [47979507, 47585556, 47278694, 47062798, 46819175, 46623731, 46456003, 46307853, 46210056, 46126770, 45972380, 45784896, 45616832, 45436041, 45208907, 44957458, 44680014, 44298640, 41048766, 37732836, 37860221]
z = [292805298, 295516599, 298379912, 301231207, 304093966, 306771529, 309378227, 311839461, 314339099, 316726282, 319257560, 321815121, 324353340, 326608609, 328529577, 330226227, 331577720, 332099760, 334017321, 336806231, 340110988]

# Створення ліній тренду на графіку
plt.plot(x, y, label = 'Україна', color = 'yellow', linewidth = 5)
plt.plot(x, z, label = 'США', color = 'red', linewidth = 5)

plt.title('Population, total', fontsize = 14) # Назва графіка
plt.xlabel('Роки', fontsize = 14, color = 'black') # Позначення осі абсцис
plt.ylabel('Кількість населення', fontsize = 14, color = 'black') # Позначення осі ординат
plt.legend(title = 'Країни:', fontsize = 14) # Позначення на графіку легенди
plt.grid(True) # Увімкнення сітки для графіка
plt.savefig('figure2.png') # Збереження даного графіку у форматі .png
plt.show() # Виведення створеного графіка на екран

