"""
Задано речення. Скласти програму, яка визначає і виводить на екран довжину його самого короткого слова.
"""

sentence = input("Введіть речення (не менше одного слова): ") # Введення користувачем речення його запис у змінну sentence
while len(sentence.strip()) == 0 or len(sentence.split(' '))<2: # Оператор циклу while, блок коду нижче виконується доти, поки користувач зможе ввести речення, що складається з кількох слів
    sentence = input("Речення не відповідає вимогам!!! Введіть речення ще раз: ") # Введення користувачем речення його запис у змінну sentence
words = sentence.split(' ') # Присвоєння змінній words кортежу слів, розділених у реченні роздільником " "
min_length = min((len(word)) for word in words) # Пошук у кортежі слів найкоротшого
print(f"Довжина найкоротшого слова у реченні '{sentence}' = ", min_length) # Форматоване виведення результату на екран
