"""
Отримати кожний 3-й символ від 4-го символу з початку і до 20-го символу (20-й символ не включається).
"""

g = str(input("Введіть речення (не менше 20 символів): ")) # Введення рядка та його запис у змінну g
while (len(g) < 20): # Оператор циклу while, блок коду нижче виконується доти, поки користувач зможе ввести речення понад 20 символів
    g = str(input(f"Символів у реченні: {len(g)}\n{len(g)} < 20\nВведіть ще раз речення (не менше 20 символів): ")) # Введення рядка та його запис у змінну g
print("Після зрізу кожного 3-го символу від 4 символу до 20-го (не включаючи): ", g[3:19:3]) # Друк на екран результату зрізу рядка