"""
Визначити найбільшу з цифр, використовуваних в десятковому запису заданого чотиризначного натурального числа n
"""

num = str(input("Введіть чотиризначне натуральне число: ")) # Введення користувачем числа
while len(num) < 4 or len(num) > 4 or num.isdigit() == 0: # Оператор циклу while, блок коду нижче виконується доти, поки користувач зможе ввести чотиризначне число
    num = str(input("Введіть число ще раз, так як воно не чотиризначне або це не число: ")) #
max_digit = max(num) # Присвоєння змінній max_digit найбільшої цифри чотиризначного числа
print(f"Найбільша цифра у чотиризначному числі {num}: ", max_digit) # Форматоване виведення результату на екран