"""
Пошук слова у списку.
"""

words = input("Введіть список слів: ").split(' ') # Розбиття введених слів на елементи списку через пробіл
print("Ваш список:", words) # Виведення на екран списку
word = input("Введіть слово для пошуку: ") # Введення користувачем слова для пошуку
if (word in words): # Умовний оператор if, якщо такий елемент списку знайдено
    index = words.index(word) # Присвоєння index індексу елемента списку
    print(f"Слово '{word}' знайдено на позиції {index} (Враховуючи, що індексація списку починається з 0)!") # Форматоване виведення результату на екран
else: # Інакше
    print(f"Слова {word} не знайдено у списку!") # Форматоване виведення результату на екран