"""
Дано одномірний масив, що складається з N цілочисельних елементів. Масив користувач має ввести з клавіатури.
Знайти суму всіх елементів масиву з парними індексами.
"""

a = [] # Оголошення списку (одновимірного масиву)
N = int(input("Введіть розмір одновимірного масиву: ")) # Введення користувачем значення кількості елементів списку
while (N <= 1): # Оператор циклу while, блок коду нижче виконується доти, поки користувач зможе ввести правильне число кількості елементів списку
    N = int(input("Введіть розмір одновимірного масиву (число має бути більше 1): ")) # Введення користувачем значення кількості елементів списку
for i in range(N): # Оператор циклу for, цикл за кількістю елементів списку
   a.append(int(input(f"[{i}] = "))) # Додання введеного значення у кінець списку
print("Одновимірний масив: ", a) # Вивід на екран списку а
s=0 # Оголошення та ініціалізація змінної для збереження суми
for i in range(len(a)):  # Оператор циклу for, цикл за кількістю елементів списку
    if (i % 2 == 0): # Умовний оператор if, якщо індекс елемента парний та не дорівнює нулю
        s += a[i] # Сума елементів, що задовольняє умові
print("Сума всіх елементів з парними індексами: ", s) # Вивід результату на екран