"""
Реалізувати функцію, яка виконує операції над множинами – задану за варіантом та друк множини на екран.
У випадку, якщо задану варіантом операцію над множиною виконати не можна, перетворіть множину у список,
а потім при виведенні на екран результівний список перетворіть на множину.

Маємо множину символів {c, d}. Скласти програму, яка додає до цієї множини множину усіх цифр.
"""

def union_of_sets(): # Визначення функції
    A = {'c', 'd'} # Оголошення та ініціалізація початкової множини символів
    B = set('0123456789') # Оголошення та ініціалізація множини всіх цифр (як символів)
    print("Початкова множина:", A) # Виведення на екран множини А
    print("Множина цифр:", B) # Виведення на екран множини В
    print("Об'єднані множини: ", A|B) # Виведення на екран об'єднання множин
    return A|B # Повернення результату
union_of_sets() # Виклик функції
