"""
Заповнити двовимірний масив розміром 7x7 таким чином, як показано на рисунку згідно з Вашим варіантом.
Вивести масив на екран.
Для виконання завдання використовуйте цикли.
"""

n = 7 # Присвоєння змінній n розмірності вкладеного списку (двовимірного масиву)
a = [[0] * n for i in range(n)] # Присвоєння елементам вкладного списку (двовимірного масиву) значення 0
for i in range(n): # Оператор циклу for, перебір вкладного списку (двовимірного масиву) по рядках
    for j in range(n): # Оператор циклу for, перебір вкладного списку (двовимірного масиву) по стовпцях
        if (i % 2 == 0 and j % 2 == 0): # Умовний оператор if, якщо індекси елементів мають парні значення
            a[i][j] = 1 # Присвоїти елементу вкладеного списку (двовимірного масиву) значення 1
        elif (i % 2 != 0 and j % 2 != 0): # Умовний оператор elif, якщо індекси елементів мають непарні значення
            a[i][j] = 1 # Присвоїти елементу вкладеного списку (двовимірного масиву) значення 1
for row in a: # Оператор циклу for, перебір всього списку
    print(' '.join([str(elem) for elem in row])) # Виведення двовимірного масиву на екран