"""
Розбиття списку на два списки за вказаним значенням інформаційного атрибута елемента для розбиття.
"""

def split_list(): # Визначення функції
    A = list(map(int, input("Введіть числовий список: ").split(' '))) # Введення списку користувачем
    print("Список:", A) # Виведення списку на екран
    value = int(input("Введіть значення інформаційного атрибута елемента за яким буде розбиватися список: ")) # Введення користувачем значення, за яким будуть розподілятися елементи списку
    list1 = [] # Оголошення першого списку
    list2 = [] # Оголошення другого списку
    for x in A: # Оператор циклу for, перебір списку
        if (x <= value): # Умовний оператор if, якщо елемент списку менше або дорівнює заданому значенню value
            list1.append(x) # Додання елемента в кінець першого списку
        else: # Інакше
            list2.append(x) # Додання елемента в кінець другого списку
    print(f"Перший список (<= {value}): ", list1) # Форматоване виведення на екран першого списку
    print(f"Другий список (> {value}): ", list2) # Форматоване виведення на екран другого списку
    return list1, list2 # Повернення результату
split_list() # Виклик функції