"""
Задано дані про зріст n=10 юнаків класу, впорядковані за зменшенням
(немає жодної пари учнів, які мають однаковий зріст).
На початку навчального року до класу вступив новий учень (його зріст не сходиться зі зростом жодного з учнів класу,
перевищує зріст самого низького учня і менше зросту найвищого).
Скласти програму, яка визначає:
а) прізвища всіх учнів, зріст яких менше росту «новенького»;
б) прізвище учня, після якого слід записати прізвище «новенького», щоб впорядкованість не порушилася;
в) прізвище учня, зріст якого найменше відрізняється від росту «новенького».
"""

def print_dict(student):
    for key, value in student.items(): # Перебір пар ключ-значення, проходячи послідовно весь словник
        print(f"Прізвище: {key}, Ріст: {value}") # Виведення на екран словника
"""
Функція print_dict(student) виводе значення словника, такі як прізвище учня і його зріст. 
Як аргумент вона приймає існуючий словник.
"""

def min_value(student):
    min_student = min(student.values()) # Визначення мінімального значення зросту учня
    return min_student # Повернення результату
"""
Функція min_value(student) визначає учня з найменшим ростом у списку та повертає результат.
Аргументом функції виступає існуючий словник.
"""

def max_value(student):
    max_student = max(student.values()) # Визначення мінімального значення зросту учня
    return max_student # Повернення результату
"""
Функція max_value(student) визначає учня з найбільшим ростом у списку та повертає результат.
Аргументом функції виступає існуючий словник.
"""

def input_student(student, new_name):
    min_h = min_value(student) # Занесення у зміну min_h результату функції min_value(student)
    max_h = max_value(student) # Занесення у зміну max_h результату функції max_value(student)
    # Користувач коректно вводить дані про учня
    while True:
        try:
            value = int(input(f"Введіть зріст учня {new_name} ({min_h} < зріст < {max_h}): "))
            if not (min_h < value < max_h):
                print(f"Помилка: Зріст має бути між {min_h} та {max_h}!")
            elif value in student.values():
                print("Помилка: Учень з таким зростом вже існує!")
            else:
                student[new_name] = value
                print(f"Учня {new_name} зі зростом {value} успішно додано!")
                break

        except ValueError:
            print("Помилка: Введіть зріст у вигляді цілого числа (наприклад, 175)!!!")
"""
Функція input_student(student, new_name) додає нового учня за ім'ям. 
Функція передбачає обробку критичних ситуацій за допомогою блок try:...except:...
Аргументами функції є словник та ім'я нового учня, що вноситься у головній функції main().
"""

def students_shorter_dict(student, new_name):
    new_height=student[new_name] # Занесення значення зросту нового учня у змінну new_height

    result = {} # Створення порожнього словника
    # Перебір елементів словника. Якщо зріст учня менший за зріст "новенького", то дані про цього учня заносяться до нового словника
    for name, height in student.items():
        if height < new_height:
            result[name] = height
    return result # Повернення словника
"""
Функція students_shorter_dict(student, new_name) дозволяє визначити прізвища всіх учнів, 
зріст яких менше росту «новенького».
Аргументами функції є словник та ім'я нового студента.
"""

def find_position(student, new_name):
    sorted_items_list = list(student.items()) # Перетворення словника у список
    # Перебір елементів словника. Якщо знайдено ім'я нового учня, то повернеться елемент, що стояв за ним
    for i in range(len(sorted_items_list)):
        name = sorted_items_list[i][0]

        if name == new_name:
            if i > 0:
                return sorted_items_list[i - 1][0]
            else:
                return None
    return None
"""
Функція find_position(student, new_name) необхідна для виведення прізвища учня, 
після якого слід записати прізвище «новенького», щоб впорядкованість не порушилася.
Аргументами функції є відсортований словник та ім'я нового студента.
"""

def closest_height(student, new_name):
    new_height = student[new_name] # Занесення значення зросту нового учня у змінну new_height
    closest_name = None
    min_diff = None
    # Перебір словника, пошук найближчого елемента до нового учня за значенням у словнику
    for name, height in student.items():
        if name == new_name:
            continue
        diff = abs(height - new_height)
        if min_diff is None or diff < min_diff:
            min_diff = diff
            closest_name = name
    return closest_name # Повернення результату
"""
Функція closest_height(student, new_name) визначає прізвище учня, 
зріст якого найменше відрізняється від росту «новенького».
Аргументом функції виступають відсортований словник та ім'я нового учня.
"""

def sorted_student(student):
    student = dict(sorted(student.items(), key=lambda x: x[1], reverse=True)) # Сортування словника за оберненим порядком
    return student # Повернення результату
"""
Функція sorted_student(student) необхідна для сортування учнів у порядку зменшення їх зросту.
Функція приймає словник як аргумент словник.
"""

def delete(student):
    name = str(input("Введіть прізвище, ім'я, по батькові студента, інформацію про якого бажаєте видалити: ")) # Введення ім'я учня, якого треба видалити
    try:
        del student[name] # Видалення учня
        print(f"Учня {name} успішно видалено!")
    except KeyError:
        print(f"Помилка: Учня з прізвищем {name} не знайдено.")
"""
Функція delete(student) необхідна для видалення учнів зі словника.
Функція передбачає обробку критичних ситуацій за допомогою блок try:...except:...
Аргументом приймає словник.
"""

def main():
    # Створення словника
    student_dict = {
        "Гриценко": 150,
        "Павленко": 178,
        "Лунцевич": 163,
        "Бабакович": 152,
        "Бринькевич": 180,
        "Мельник": 154,
        "Гринькевич": 147,
        "Ждан": 190,
        "Фамільянович": 181,
        "Отрукиотбиванич": 134
    }
    # Нескінченний цикл взаємодії зі словником
    while True:
        print("-------------------------------\nГОЛОВНЕ МЕНЮ:\n>0< - Вихід;\n>1< - Вивести на екран всіх учнів за ростом у напрямку спадання;\n>2< - Робота з новим учнем;\n>3< - Видалити учня;\n>4< - Вивести на екран всіх учнів за алфавітним порядком.\n-------------------------------")
        choice = input("Виберіть пункт меню: ")
        if (choice == "1"):
            sort_student = sorted_student(student_dict)
            print_dict(sort_student)
        elif (choice == "2"):
            name = str(input("Введіть прізвище учня, якого бажаєте додати: "))
            while name in  student_dict.keys():
                print("Учень із таким прізвищем уже існує!")
                name = input("Введіть інше прізвище: ")
            input_student(student_dict, name)
            print("-------------------------------\nПІДМЕНЮ:\n2.1 - Вивести прізвища всіх учнів, зріст яких менше росту «новенького»;\n2.2 - Вивести прізвище учня, після якого слід записати прізвище «новенького», щоб впорядкованість не порушилася;\n2.3 - Вивести прізвище учня, зріст якого найменше відрізняється від росту «новенького»;\n2.4 - Вивести всіх учнів;\n2.0 - Вихід з підменю.\n-------------------------------")
            while True:
                choice = input("Виберіть пункт підменю: ")
                if (choice == "2.1"):
                    print("Учні з ростом меншим за новенького:")
                    print_dict(students_shorter_dict(student_dict, name))
                elif (choice == "2.2"):
                    print(f"Прізвище учня, після якого слід записати прізвище «новенького» - {name}, щоб впорядкованість не порушилася: {find_position(sorted_student(student_dict), name)}")
                elif (choice == "2.3"):
                    print(f"Прізвище учня, зріст якого найменше відрізняється від росту «новенького» - {name}: {closest_height(student_dict, name)}")
                elif (choice == "2.4"):
                    print("Оновлений словник:")
                    sort_student = sorted_student(student_dict)
                    print_dict(sort_student)
                elif (choice == "2.0"):
                    break
                else:
                    print("Невірний вибір!!!")
        elif (choice == "3"):
            delete(student_dict)
        elif (choice == "4"):
            sort_student = dict(sorted(student_dict.items()))
            print_dict(sort_student)
        elif (choice == "0"):
            break
        else:
            print("Невірний вибір!!!")
main()
"""
main() - Головна функція програми, у якій відбувається вся "магія", або ж просто операції зі словником.
"""